console.log('Score: 110 / 100\n\
- [x] Вёрстка валидная +10\n\
- [x] Вёрстка семантическая +20\n\
В коде странице присутствуют следующие элементы (указано минимальное количество, может быть больше):\n\
- [x] <header>, <main>, <footer> +3\n\
- [x] пять элементов <section> (по количеству секций) +3\n\
- [x] только один заголовок <h1> +3\n\
- [x] четыре заголовка <h2> (количество секций минус одна, у которой заголовок <h1>) +3\n\
- [x] один элемент <nav> (панель навигации) +3\n\
- [x] два списка ul > li > a (панель навигации, ссылки на соцсети) +3\n\
- [x] пять кнопок <button> +2\n\
- [x] Вёрстка соответствует макету +48\n\
- [x] блок <header> +6\n\
- [x] секция welcome +7\n\
- [x] секция about +7\n\
- [x] секция service +7\n\
- [x] секция prices +7\n\
- [x] секция contacts +7\n\
- [x] блок <footer> +7\n\
- [x] Требования к css + 12\n\
- [x] для построения сетки используются флексы или гриды +2\n\
- [x] при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону +2\n\
- [x] фоновый цвет тянется на всю ширину страницы +2\n\
- [x] иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления +2\n\
- [x] изображения добавлены в формате .jpg или .png +2\n\
- [x] есть favicon +2\n\
- [x] Интерактивность, реализуемая через css +20\n\
- [x] плавная прокрутка по якорям +5\n\
- [x] cсылки в футере при нажатии на них ведут на гитхаб автора проекта и на страницу курса https://rs.school/js-stage0/ +5\n\
- [x] интерактивность включает в себя не только изменение внешнего вида курсора, например,\n\
при помощи свойства cursor: pointer, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта.\n\
Если в макете указаны стили при наведении и клике, для элемента указываем эти стили.\n\
Если в макете стили не указаны, реализуете их по своему усмотрению, руководствуясь общим стилем макета +5\n\
- [x] обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +5')